app/views/recipes/show.html.erb

	<ul>
	<% @recipe.recipe_ingredient_quantities.each do |recipe_ingredient| %>
---
SELECT "recipe_ingredient_quantities".* FROM "recipe_ingredient_quantities" WHERE "recipe_ingredient_quantities"."recipe_id" = ?  [["recipe_id", 8]]