app/views/ingredients/_form.html.erb

SELECT "ingredient_types".* FROM "ingredient_types"
---
    <%= f.label :ingredient_type_id %><br>
    <div><%= f.collection_select :ingredient_type_id, IngredientType.all, :id, :name %></div>