app/views/ingredients/show.html.erb

SELECT "months".* FROM "months" INNER JOIN "ingredient_availabilities" ON "months"."id" = "ingredient_availabilities"."month_id" WHERE "ingredient_availabilities"."ingredient_id" = ?  [["ingredient_id", 162]]
---
  <strong>Availability:</strong>
  <% @ingredient.months.each do |month| %>