app/controllers/ingredients_controller.rb

  def index
    if params[:ingredient].present? then
      params_decoded = params[:ingredient][:ingr_type]
      case

        when params_decoded == "Vegan"
          @ingredients = Ingredient.vegan_ingredients.includes(:ingredient_type)
---
SELECT "ingredients".* FROM "ingredients"
SELECT "ingredient_types".* FROM "ingredient_types" WHERE "ingredient_types"."id" IN (99, 100, 101, 102, 103, 104, 105, 106, 107)

  def create
    @ingredient = Ingredient.new(ingredient_params)

    respond_to do |format|
      if @ingredient.save
---
INSERT INTO "ingredients" ("name", "quantity", "quantity_unit", "ingredient_type_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Carrots"], ["quantity", 2.0], ["quantity_unit", ""], ["ingredient_type_id", 6], ["created_at", "2015-03-25 00:25:38.248897"], ["updated_at", "2015-03-25 00:25:38.248897"]]

  def update
    respond_to do |format|
      if @ingredient.update(ingredient_params)
---
UPDATE "ingredients" SET "name" = ?, "quantity" = ?, "updated_at" = ? WHERE "ingredients"."id" = ?  [["name", "Carrots"], ["quantity", 2.0], ["updated_at", "2015-03-25 00:05:04.613560"], ["id", 1]]

  def destroy
    @ingredient.destroy
---
DELETE FROM "ingredients" WHERE "ingredients"."id" = ?  [["id", 1]]