app/controllers/ingredient_availabilities_controller.rb

SELECT "months".* FROM "months"
SELECT "ingredients".* FROM "ingredients" INNER JOIN "ingredient_availabilities" ON "ingredients"."id" = "ingredient_availabilities"."ingredient_id" WHERE "ingredient_availabilities"."month_id" = ?  [["month_id", 1]]
---
	def index
		ingredient_id = params[:ingredient_type]
		month_id = params[:month]

		@ingredients = Ingredient.all

		if ingredient_id.present?
			@ingredients = @ingredients.where(ingredient_type_id: ingredient_id)
		end

		if month_id.present?
			@ingredients = @ingredients.joins(:ingredient_availabilities).where(ingredient_availabilities: {month_id: month_id})

INSERT INTO "ingredient_availabilities" ("month_id", "ingredient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["month_id", 4], ["ingredient_id", 171], ["created_at", "2015-03-30 01:06:16.125389"], ["updated_at", "2015-03-30 01:06:16.125389"]]
---
	def create
		@ingredient_availability = IngredientAvailability.new(ingredient_availability_params)
		@ingredient_availability.save