app/controllers/ingredient_types_controller.rb

SELECT "ingredient_types".* FROM "ingredient_types"
---
  def index
    @ingredient_types = IngredientType.all

INSERT INTO "ingredient_types" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Meat"], ["created_at", "2015-03-25 00:16:31.498162"], ["updated_at", "2015-03-25 00:16:31.498162"]]
---
  def create
    @ingredient_type = IngredientType.new(ingredient_type_params)

    respond_to do |format|
      if @ingredient_type.save

DELETE FROM "ingredient_types" WHERE "ingredient_types"."id" = ?  [["id", 1]]
---
  def destroy
    @ingredient_type.destroy

SELECT  "ingredient_types".* FROM "ingredient_types" WHERE "ingredient_types"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_ingredient_type
      @ingredient_type = IngredientType.find(params[:id])