app/controllers/ingredient_availability_controller.rb

	def index
		@ingredient_availabilities = IngredientAvailability.all
---
SELECT "ingredient_availabilities".* FROM "ingredient_availabilities"