app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT "recipes".* FROM "recipes" WHERE "recipes"."meal_type" = ? AND ("recipes"."prep_time" BETWEEN 0 AND 15)  [["meal_type", ""]]
---
  def index

    if params[:recipe].present?
      if params[:recipe][:ingredient_type_picker].present?
        ingredient_type = params[:recipe][:ingredient_type_picker]
        @recipes = Recipe.ingredient_type_filter(ingredient_type)

      else
        prep_time = params[:recipe][:prep_time].to_i
        meal_type = params[:recipe][:meal_type]

        @recipes = Recipe.meal_filter(prep_time, meal_type)
      end

    else
      @recipes = Recipe.all

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    recipe_id = params[:id].to_i
    @recipe = Recipe.find(recipe_id)

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 8]]
---
  def edit
    recipe_id = params[:id].to_i
    @recipe = Recipe.find(recipe_id)

INSERT INTO "recipes" ("name", "instructions", "prep_time", "meal_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Anchovy Pizza"], ["instructions", "Pasdasda"], ["prep_time", 2], ["meal_type", "Entree"], ["created_at", "2015-03-26 13:58:48.620234"], ["updated_at", "2015-03-26 13:58:48.620234"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", 8]]
INSERT INTO "shopping_lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Baked Eggs"], ["created_at", "2015-03-29 22:14:40.803643"], ["updated_at", "2015-03-29 22:14:40.803643"]]
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."name" = ? LIMIT 1  [["name", "Baked Eggs"]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", 143]]
SELECT "recipe_ingredient_quantities".* FROM "recipe_ingredient_quantities" WHERE "recipe_ingredient_quantities"."recipe_id" = ?  [["recipe_id", 8]]
INSERT INTO "shopping_list_items" ("shopping_list_id", "recipe_ingredient_quantity_id", "done", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["shopping_list_id", 9], ["recipe_ingredient_quantity_id", 1], ["done", "f"], ["created_at", "2015-03-29 23:29:03.037185"], ["updated_at", "2015-03-29 23:29:03.037185"]]
---
  def generate_shopping_list
    recipe_id = params[:id].to_i
    @recipe = Recipe.find(recipe_id)

    recipe_name = @recipe.name

    ShoppingList.create(name: recipe_name)
    shopping_list_id = ShoppingList.find_by(name: recipe_name).id
    @recipe.recipe_ingredient_quantities.all.each do |recipe_ingredient_qty|
        ShoppingListItem.create(
          shopping_list_id: shopping_list_id,
          ingredient_name: recipe_ingredient_qty.ingredient.name,
          ingredient_quantity: recipe_ingredient_qty.quantity,
          ingredient_quantity_unit: recipe_ingredient_qty.quantity_unit,
          done: false )