app/controllers/recipe_ingredient_quantities_controller.rb

SELECT "recipe_ingredient_quantities".* FROM "recipe_ingredient_quantities"
---
  def index
    @recipe_ingredient_quantities = RecipeIngredientQuantity.all