app/controllers/shopping_lists_controller.rb

  def index
    @shopping_lists = ShoppingList.all
---
SELECT "shopping_lists".* FROM "shopping_lists"

  def destroy
    @shopping_list.destroy
---
DELETE FROM "shopping_lists" WHERE "shopping_lists"."id" = ?  [["id", 14]]

    def set_shopping_list
      @shopping_list = ShoppingList.find(params[:id])
---
SELECT  "shopping_lists".* FROM "shopping_lists" WHERE "shopping_lists"."id" = ? LIMIT 1  [["id", 16]]