app/views/ingredient_availabilities/index.html.erb

SELECT "months".* FROM "months"
---

	  		<%= select_tag "month", options_from_collection_for_select(Month.all, 'id' ,'name' ), class: 'form-control ingredient-avail-selector'  %>