app/views/ingredient_availabilities/new.html.erb

	  <%= f.label :month_id %><br>
	  <%= f.select :month_id, options_from_collection_for_select(Month.all, 'id' ,'name' ), {}, :multiple => true %>
---
SELECT "months".* FROM "months"

		<%= f.label :ingredient_id %><br>
		<%= f.select :ingredient_id, options_from_collection_for_select(Ingredient.all, 'id' ,'name' ) %>
---
SELECT "ingredients".* FROM "ingredients"